views/fee/students-fee.php

SELECT * FROM `fee_discount_types` WHERE (`fk_branch_id`=1) AND (`is_active`=1)
SELECT `id`, `title` FROM `fee_head` WHERE (`branch_id`=1) AND (`extra_head`=1)
---
  $fromConvert=date('Y-m',strtotime($Fromdate));
  $toConvert=date('Y-m',strtotime($toDate));
$student_info = \Yii::$app->common->getStudent($student_id);
$discount_type= ArrayHelper::map(\app\models\FeeDiscountTypes::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'is_active'=>1])->all(),'id','title');
$exteraHeadArrayMap = \app\models\FeeHead::find()->select(['id','title'])->where(['branch_id'=>Yii::$app->common->getBranch(),'extra_head'=>1])->asArray()->all();

SELECT * FROM `transport_allocation` WHERE (`stu_id`=541) AND (`status`=1) AND (`on_off`=1)
---
$setting_fine_amount = $settings->absent_fine;
$student_details = Yii::$app->common->getStudent($student_id);
if($settings->transport_on_off == 1){
$transport        = \app\models\TransportAllocation::find()->where(['stu_id'=>$student_details->user_id,'status'=>1,'on_off'=>1])->one();

SELECT * FROM `hostel_detail` WHERE (`fk_student_id`=540) AND (`is_booked`=1)
SELECT * FROM `stop` WHERE `id`=4
---
  $transport        = \app\models\TransportAllocation::find()->where(['stu_id'=>$student_details->user_id,'status'=>1,'on_off'=>0])->one();
}

$hostel           = \app\models\HostelDetail::find()->where(['fk_student_id'=>$student_details->stu_id,
'is_booked'=>1])->one();
/*check if student avail transport*/
if(count($transport)>0){
  $stop = \app\models\Stop::find()->where(['id'=>$transport->fk_stop_id])->One();

SELECT COUNT(*) FROM `student_attendance` WHERE ((`fk_stu_id`=540) AND (`fk_branch_id`=1) AND (`leave_type`='absent')) AND (`date` >= '2020-12-01') AND (`date` <= '2020-12-31')
SELECT `amount` FROM `fine_class_wise` WHERE (`class_id`=14) AND (`status`='active')
---
  //}
}
/*absend fine*/
$absent_count =\app\models\StudentAttendance::find()->where(['fk_stu_id'=>intval($student_id),'fk_branch_id'=>yii::$app->common->getBranch(),'leave_type'=>'absent'])->andWhere(['>=','date',$Fromdate])->andWhere(['<=','date',$toDate])->count();
$classWiseFine = \app\models\FineClassWise::find()->select(['amount'])->where(['class_id'=>$student_details->class_id,'status'=>'active'])->one();

SELECT from_date,to_date,sum(head_recv_amount) as total_amount,transport_amount,hostel_amount,absent_fine,transport_arrears,hostel_arrears FROM `fee_submission` WHERE (`stu_id`=540) AND (`branch_id`=1) AND (`fee_status`=1) GROUP BY `from_date`, `to_date`, `transport_amount`, `hostel_amount`, `absent_fine`, `transport_arrears`, `hostel_arrears`
SELECT `from_date`, `to_date`, `hostel_amount`, `absent_fine`, `transport_arrears`, `hostel_arrears` FROM `fee_submission` WHERE ((`stu_id`=540) AND (`branch_id`=1)) AND (`from_date` = '2020-12')
---
     <?php
     $previous_history_amt=0;
     $head_arrears_previous=0;
      $PreviousFeeTakenMonth=\app\models\FeeSubmission::find()->select(['from_date,to_date,sum(head_recv_amount) as total_amount,transport_amount,hostel_amount,absent_fine,transport_arrears,hostel_arrears'])->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->groupBy('from_date,to_date,transport_amount,hostel_amount,absent_fine,transport_arrears,hostel_arrears')->asArray()->one();

      $FineOrFeeTakenMonthWise =\app\models\FeeSubmission::find()->select('from_date,to_date,hostel_amount,absent_fine,transport_arrears,hostel_arrears')->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch()])->andWhere(['=','from_date',$fromConvert])->one();

SELECT SUM(amount) FROM `fee_arrears_rcv` WHERE `stu_id`=540
SELECT SUM(arears) FROM `fee_arears` WHERE (`stu_id`=540) AND (`status`=1) AND (`branch_id`=1)
---
      }


      $fee_arrears_rcv=\app\models\FeeArrearsRcv::find()->where(['stu_id'=>intval($student_id)])->sum('amount');
     $head_arrears_previous = \app\models\FeeArears::find()->where(['stu_id'=>intval($student_id),'status'=>1,'branch_id'=>yii::$app->common->getBranch()])->sum('arears');

SELECT SUM(transport_arrears) FROM `fee_submission` WHERE ((`stu_id`=540) AND (`branch_id`=1) AND (`fee_status`=1)) AND (find_in_set("2020-03", year_month_interval ) AND find_in_set( "2020-03", year_month_interval ))
SELECT SUM(hostel_arrears) FROM `fee_submission` WHERE ((`stu_id`=540) AND (`branch_id`=1) AND (`fee_status`=1)) AND (find_in_set("2020-03", year_month_interval ) AND find_in_set( "2020-03", year_month_interval ))
---
      }
      if(!empty($PreviousFeeTakenMonth['from_date'])){
          /*get  transport arrears query */
           $transport_arrears_query =\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->andWhere('find_in_set("'.$PreviousFeeTakenMonth['from_date'].'", year_month_interval ) AND find_in_set( "'.$PreviousFeeTakenMonth['to_date'].'", year_month_interval )')->sum('transport_arrears');
          /*get  transport arrears query */
           /*get  and hostel arrears query */
           $hostel_arrears_query =\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->andWhere('find_in_set("'.$PreviousFeeTakenMonth['from_date'].'", year_month_interval ) AND find_in_set( "'.$PreviousFeeTakenMonth['to_date'].'", year_month_interval )')->sum('hostel_arrears');

SELECT * FROM `fee_arears` WHERE (`stu_id`=540) AND (`branch_id`=1) AND (`fee_head_id`=1) AND (`status`=1)
SELECT `year_month_interval` FROM `fee_submission` WHERE (`stu_id`=540) AND (`branch_id`=1) AND (`fee_head_id`=1) GROUP BY `year_month_interval`
---
            foreach ($getFeeDetails as $key=> $getFeeDetails) {
            $total_amount =0;
            /*get fee arrears*/
            $fee_arrears = \app\models\FeeArears::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_head_id'=>$getFeeDetails->fk_fee_head_id,'status'=>1])->one();
            $getDateFeesCount=\app\models\FeeSubmission::find()->select(['year_month_interval'])->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_head_id'=>$getFeeDetails->fk_fee_head_id])->groupBy(['year_month_interval'])->asArray()->all();

SELECT * FROM `fee_submission` WHERE ((`stu_id`=540) AND (`branch_id`=1) AND (`fee_head_id`=1)) AND (`from_date` >= '2020-12') AND (`to_date` <= '2020-12')
---
            }
            $explode_interval  =  explode(',', $interval_concat);
            if(!in_array($fromConvert, $explode_interval) && !in_array($toConvert, $explode_interval)){
              $getDateFees=\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_head_id'=>$getFeeDetails->fk_fee_head_id])->andWhere(['>=','from_date',$fromConvert])->andWhere(['<=','to_date',$toConvert])->one();

SELECT * FROM `fee_plan` WHERE (`fee_head_id`=1) AND (`stu_id`='540') AND (`status`=1)
SELECT * FROM `fee_head` WHERE (`branch_id`=1) AND (`id`=1)
---
               $alert=1;
            }else{
               $alert=2;
              $getDiscountPercent=\app\models\FeePlan::find()->where(['fee_head_id'=>$getFeeDetails->fk_fee_head_id,'stu_id'=>$student_id,'status'=>1])->one();
              $getHead=\app\models\FeeHead::find()->where(['branch_id'=>yii::$app->common->getBranch(),'id'=>$getFeeDetails->fk_fee_head_id])->one();

SELECT * FROM `fee_submission` WHERE (`stu_id`=540) AND (`branch_id`=1) AND (`fee_head_id`=4)
---

                 /*if head is one time*/
              if($getHead->one_time_payment == 1){
                $onetimeFees=\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_head_id'=>$getFeeDetails->fk_fee_head_id])->one();

SELECT COUNT(*) FROM `stu_reg_log_association` WHERE `fk_stu_id`='540'
SELECT COUNT(*) FROM `stu_reg_log_association` WHERE (`fk_stu_id`=540) AND (date(promoted_date) >= '2020-03-30') AND (date(promoted_date) <= '2021-03-30')
SELECT SUM(head_recv_amount) FROM `fee_submission` WHERE ((`stu_id`=540) AND (`branch_id`=1) AND (`fee_head_id`=4)) AND (YEAR(recv_date) BETWEEN '2020-03-30' AND '2021-03-30')
---
               // $sessionEndDate=$settings->current_session_end;
               $sessionStartDate=date('Y-m-d',strtotime($settings->current_session_start));
               $sessionEndDate=date('Y-m-d',strtotime($settings->current_session_end));
               $oldStudent=\app\models\StuRegLogAssociation::find()->where(['fk_stu_id'=>$student_id])->count();

              $promotedData=\app\models\StuRegLogAssociation::find()->where(['fk_stu_id'=>intval($student_id)])->andWhere(['>=','date(promoted_date)',$sessionStartDate])->andWhere(['<=','date(promoted_date)',$sessionEndDate])->count();
    // echo $promotedData;die;

              if($getHead->promotion_head == 1){
               $promotionFeeReceive =\app\models\FeeSubmission::find()
               ->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_head_id'=>$getFeeDetails->fk_fee_head_id])
               ->andWhere(['between', 'YEAR(recv_date)', $sessionStartDate, $sessionEndDate])
                ->sum('head_recv_amount');