views/layouts/menuroles/accountant_menu.php

SELECT * FROM `employee_info` WHERE `user_id`=1571
---
use app\components\widgets\Nav;
use yii\bootstrap\NavBar;
use yii\helpers\Url;
$getEmployee=\app\models\EmployeeInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();