views/layouts/menuroles/student_menu.php

SELECT * FROM `student_info` WHERE `user_id`=598
SELECT * FROM `student_parents_info` WHERE `stu_id`=597
SELECT * FROM `student_parents_info` WHERE `cnic`='15302-0852381-5'
---
use yii\helpers\Url;
use app\models\StudentInfo;
use app\models\StudentParentsInfo;
$student=StudentInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
$getParents=StudentParentsInfo::find()->where(['stu_id'=>$student->stu_id])->one();
$getParentsChilds=StudentParentsInfo::find()->where(['cnic'=>$getParents->cnic])->all();

SELECT * FROM `user` WHERE `id`=598
---
	?>
 <li>
 <a href="<?php echo Url::to(['student/profile','id'=>$child->stu_id]) ?>" tabindex="-1"><span>
 <i class="fa fa-circle-o"></i></span> <?php echo $child->stu->user->first_name ?></a>