views/reports/slc.php

			 <div class="row">
			 	<div class="col-md-2">
			 <?php
			 $class_array = ArrayHelper::map(\app\models\RefClass::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->all(), 'class_id', 'title');
---
SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')

				<div class="row">
        <div class="col-sm-3">
          <?php
        $stuQuery = User::find()
            ->select(['employee_info.emp_id',"user.id,concat(user.first_name, ' ' ,  user.last_name) as name"])
            ->innerJoin('employee_info','employee_info.user_id = user.id')
            ->where(['employee_info.fk_branch_id'=>yii::$app->common->getBranch()])->asArray()->all();
---
SELECT `employee_info`.`emp_id`, user.id,concat(user.first_name, ' ' ,  user.last_name) as name FROM `user` INNER JOIN `employee_info` ON employee_info.user_id = user.id WHERE `employee_info`.`fk_branch_id`=1

        <div class="row">
        <div class="col-md-3">
                <label for="class">Class</label>
                <?= Html::dropDownList('ref_class', null,
                    ArrayHelper::map(RefClass::find()->where(['fk_branch_id'=>yii::$app->common->getBranch(),'status'=>'active'])->all(), 'class_id', 'title'),['prompt'=>'Select Class','class'=>'form-control','id'=>'studentClassWise','data-url'=>Url::to(['student/class-active-inactive-students'])]) ?>
---
SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')