views/layouts/main.php

    $action     = Yii::$app->controller->action->id;
    $user = Yii::$app->user->identity;
    $directoryAsset = Yii::$app->request->baseUrl;
    $colors=\app\models\Colors::find()->one();
---
SELECT * FROM `colors`

    }else{
        $logo = '/img/logo.png';
    }
    $studentInfo = \app\models\StudentInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
---
SELECT * FROM `student_info` WHERE `user_id` IS NULL

                    </div>
                    <div class="pull-left info">
                        <p style="color:#<?php echo $colors->sidebartextcolor; ?>"><?php
        $smsSet=\app\models\SmsSettings::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->one();
---
SELECT * FROM `sms_settings` WHERE `fk_branch_id`=FALSE