views/transport-allocation/_form.php

SELECT * FROM `zone` WHERE `fk_branch_id`=1
---
    <?php $form = ActiveForm::begin(); ?>

    <?php
                $zone = ArrayHelper::map(Zone::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->all(), 'id', 'title');

SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')
---
            }
            ?>
            <label for="class">Class</label>
                  <?= Html::dropDownList('ref_class', null,
                      ArrayHelper::map(\app\models\RefClass::find()->where(['fk_branch_id'=>yii::$app->common->getBranch(),'status'=>'active'])->all(), 'class_id', 'title'),['prompt'=>'Select Class','class'=>'form-control','id'=>'studentClassWise','data-url'=>Url::to(['student/class-wise-students'])]) ?>