views/reports/statistics/leave-school-year-student.php

SELECT * FROM `user` WHERE `id`=839
---
                              ?>
                            <tr>
                                <td><?php echo $count; ?></td>
                                <td><?php echo $leaveInfo->stu->user->first_name .' '.$leaveInfo->stu->user->last_name ?></td>