views/fee/report/bulk-fee-slip-pdf.php

        $student_details = Yii::$app->common->getStudent($student_id);

        if($settings->transport_on_off == 1){
            $transport        = \app\models\TransportAllocation::find()->where(['stu_id'=>$student_details->user_id,'status'=>1,'on_off'=>1])->one();
        }else{
          $transport        = \app\models\TransportAllocation::find()->where(['stu_id'=>$student_details->user_id,'status'=>1,'on_off'=>0])->one();
      }
      $hostel = \app\models\HostelDetail::find()->where(['fk_student_id' => $student_details->stu_id, 'is_booked' => 1])->one();
---
SELECT * FROM `transport_allocation` WHERE (`stu_id`=2440) AND (`status`=1) AND (`on_off`=1)
SELECT * FROM `hostel_detail` WHERE (`fk_student_id`=2286) AND (`is_booked`=1)

        //}
    }
    /*absend fine*/
    $absent_count = \app\models\StudentAttendance::find()->where(['fk_stu_id' => intval($student_id), 'fk_branch_id' => yii::$app->common->getBranch(),'leave_type'=>'absent'])->andWhere(['>=', 'date', $Fromdate])->andWhere(['<=', 'date', $toDate])->count();
    $classWiseFine = \app\models\FineClassWise::find()->select(['amount'])->where(['class_id'=>$student_details->class_id,'status'=>'active'])->one();
---
SELECT COUNT(*) FROM `student_attendance` WHERE ((`fk_stu_id`=2286) AND (`fk_branch_id`=1) AND (`leave_type`='absent')) AND (`date` >= '2021-11-01') AND (`date` <= '2021-11-30')
SELECT `amount` FROM `fine_class_wise` WHERE (`class_id`=1) AND (`status`='active')

        <?php
        $previous_history_amt = 0;
        $head_arrears_previous = 0;
        $PreviousFeeTakenMonth = \app\models\FeeSubmission::find()->select('from_date,to_date,sum(head_recv_amount) as total_amount,transport_amount,hostel_amount,absent_fine,transport_arrears,hostel_arrears')->where(['stu_id' => intval($student_id), 'branch_id' => yii::$app->common->getBranch(), 'fee_status' => 1])->orderBy(['id' => SORT_ASC])->asArray()->one();
        $head_arrears_previous = \app\models\FeeArears::find()->where(['stu_id' => intval($student_id), 'status' => 1, 'branch_id' => yii::$app->common->getBranch()])->sum('arears');
---
SELECT `from_date`, `to_date`, sum(head_recv_amount) as total_amount, `transport_amount`, `hostel_amount`, `absent_fine`, `transport_arrears`, `hostel_arrears` FROM `fee_submission` WHERE (`stu_id`=2286) AND (`branch_id`=1) AND (`fee_status`=1) ORDER BY `id`
SELECT SUM(arears) FROM `fee_arears` WHERE (`stu_id`=2286) AND (`status`=1) AND (`branch_id`=1)

        }
        if (!empty($PreviousFeeTakenMonth['from_date'])) {
           /*get  transport arrears query */
           $transport_arrears_query =\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->andWhere('find_in_set("'.$PreviousFeeTakenMonth['from_date'].'", year_month_interval ) AND find_in_set( "'.$PreviousFeeTakenMonth['to_date'].'", year_month_interval )')->sum('transport_arrears');
           /*get  transport arrears query */
           /*get  and hostel arrears query */
           $hostel_arrears_query =\app\models\FeeSubmission::find()->where(['stu_id'=>intval($student_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->andWhere('find_in_set("'.$PreviousFeeTakenMonth['from_date'].'", year_month_interval ) AND find_in_set( "'.$PreviousFeeTakenMonth['to_date'].'", year_month_interval )')->sum('hostel_arrears');
---
SELECT SUM(transport_arrears) FROM `fee_submission` WHERE ((`stu_id`=2286) AND (`branch_id`=1) AND (`fee_status`=1)) AND (find_in_set("2021-10", year_month_interval ) AND find_in_set( "2021-10", year_month_interval ))
SELECT SUM(hostel_arrears) FROM `fee_submission` WHERE ((`stu_id`=2286) AND (`branch_id`=1) AND (`fee_status`=1)) AND (find_in_set("2021-10", year_month_interval ) AND find_in_set( "2021-10", year_month_interval ))

                $fromConvert = date('Y-m', strtotime($Fromdate));
                $toConvert = date('Y-m', strtotime($toDate));
                /*get fee arrears*/
                $fee_arrears = \app\models\FeeArears::find()->where(['stu_id' => intval($student_id), 'branch_id' =>yii::$app->common->getBranch(), 'fee_head_id' => $getFeeDetails->fk_fee_head_id, 'status' => 1])->one();

                $total_fee_amount=\app\models\FeeGroup::find()->select(['amount'])->where(['fk_branch_id'=>yii::$app->common->getBranch(),'fk_fee_head_id'=>$getFeeDetails->fk_fee_head_id,'fk_class_id'=>$class_id])->one();

                $getDateFees = \app\models\FeeSubmission::find()->where(['stu_id' => intval($student_id), 'branch_id' => yii::$app->common->getBranch(), 'fee_head_id' => $getFeeDetails->fk_fee_head_id])->andWhere(['>=', 'from_date', $fromConvert])->andWhere(['<=', 'to_date', $toConvert])->one();
---
SELECT * FROM `fee_arears` WHERE (`stu_id`=2286) AND (`branch_id`=1) AND (`fee_head_id`=1) AND (`status`=1)
SELECT `amount` FROM `fee_group` WHERE (`fk_branch_id`=1) AND (`fk_fee_head_id`=1) AND (`fk_class_id`='1')
SELECT * FROM `fee_submission` WHERE ((`stu_id`=2286) AND (`branch_id`=1) AND (`fee_head_id`=1)) AND (`from_date` >= '2021-11') AND (`to_date` <= '2021-11')

                    $alert = 1;
                } else {
                    $alert = 2;
                    $getDiscountPercent = \app\models\FeePlan::find()->where(['fee_head_id' => $getFeeDetails->fk_fee_head_id, 'stu_id' => $student_id, 'status' => 1])->one();
                    $getHead = \app\models\FeeHead::find()->where(['branch_id' => yii::$app->common->getBranch(), 'id' => $getFeeDetails->fk_fee_head_id])->one();
                    /*if head is one time*/
                    if ($getHead->one_time_payment == 1) {
                        $onetimeFees = \app\models\FeeSubmission::find()->where(['stu_id' => intval($student_id), 'branch_id' => yii::$app->common->getBranch(), 'fee_head_id' => $getFeeDetails->fk_fee_head_id])->one();
---
SELECT * FROM `fee_plan` WHERE (`fee_head_id`=1) AND (`stu_id`='2286') AND (`status`=1)
SELECT * FROM `fee_head` WHERE (`branch_id`=1) AND (`id`=1)
SELECT * FROM `fee_submission` WHERE (`stu_id`=2286) AND (`branch_id`=1) AND (`fee_head_id`=2)

                    /*new code salman*/
                    $sessionStartDate=date('Y-m-d',strtotime($settings->current_session_start));
                    $sessionEndDate=date('Y-m-d',strtotime($settings->current_session_end));
                    $oldStudent=\app\models\StuRegLogAssociation::find()->where(['fk_stu_id'=>$student_id])->count();
                    $promotedData=\app\models\StuRegLogAssociation::find()->where(['fk_stu_id'=>intval($student_id)])->andWhere(['>=','date(promoted_date)',$sessionStartDate])->andWhere(['<=','date(promoted_date)',$sessionEndDate])->count();
---
SELECT COUNT(*) FROM `stu_reg_log_association` WHERE `fk_stu_id`='2286'
SELECT COUNT(*) FROM `stu_reg_log_association` WHERE (`fk_stu_id`=2286) AND (date(promoted_date) >= '2021-03-31') AND (date(promoted_date) <= '2022-03-31')