controllers/AnalysisController.php

    public function actionGetSectionPdf(){
       $searchModel = new StudentInfoSearch();
       $class_val= Yii::$app->request->get('classval');
       $groupval= Yii::$app->request->get('groupval');
       $sectionval= Yii::$app->request->get('sectionval');
       $searchModel->is_active=1;
                $class      = $class_val;
                $group      = $groupval;
                $section    = $sectionval;
                /*filter for students details.*/
                if($class){
                    $searchModel->class_id = $class;
                }
                if($group){
                    $searchModel->group_id = $group;
                }
                if($section){
                    $searchModel->section_id = $section;
                }
                $StudentQuery = StudentInfo::find()
                    ->select(['class_id','group_id','section_id'])
                    ->where([
                        'fk_branch_id'  =>Yii::$app->common->getBranch(),
                        'class_id'   => $class_val,
                        'group_id'   => ($groupval)?$groupval:null,
                        'section_id' => $sectionval,
                    ])->groupBy(['class_id','group_id','section_id']);
---
SELECT `class_id`, `group_id`, `section_id` FROM `student_info` WHERE (`fk_branch_id`=1) AND (`class_id`='4') AND (`group_id` IS NULL) AND (`section_id`='17') GROUP BY `class_id`, `group_id`, `section_id`

    public function actionGetEmptyAwardPdf(){
       $class_val= Yii::$app->request->get('classval');
       $groupval= Yii::$app->request->get('groupval');
       $sectionval= Yii::$app->request->get('sectionval');
        $studentDetails = StudentInfo::find()
            ->select(['user_id','stu_id','roll_no','class_id','group_id','section_id'])
            ->where([
                'fk_branch_id'  =>Yii::$app->common->getBranch(),
                'class_id'   => $class_val,
                'group_id'   => ($groupval)?$groupval:null,
                'section_id' => $sectionval,
                'is_active'=>1
            ])->orderBy(['roll_no'=>SORT_ASC])->all();
---
SELECT `user_id`, `stu_id`, `roll_no`, `class_id`, `group_id`, `section_id` FROM `student_info` WHERE (`fk_branch_id`=1) AND (`class_id`='12') AND (`group_id` IS NULL) AND (`section_id`='25') AND (`is_active`=1) ORDER BY `roll_no`