controllers/ExamsController.php

SELECT `student_info`.`stu_id`, `student_info`.`is_active`, `u`.`username` AS `roll_no`, `u`.`id` AS `user_id` FROM `student_info` INNER JOIN `user` `u` ON u.id=student_info.user_id INNER JOIN `stu_reg_log_association` `st` ON  st.fk_stu_id=student_info.stu_id WHERE (`student_info`.`fk_branch_id`=1) AND (`st`.`current_class_id`='17') AND (`st`.`current_group_id` IS NULL) AND (`st`.`current_section_id`='39')
SELECT `si`.`stu_id`, `si`.`is_active`, concat(u.first_name," ",u.middle_name," ",u.last_name) student_name FROM `exam` INNER JOIN `exam_type` `et` ON et.id=exam.fk_exam_type INNER JOIN `ref_class` `c` ON c.class_id=exam.fk_class_id INNER JOIN `subjects` `sb` ON sb.id=exam.fk_subject_id LEFT JOIN `student_marks` `sm` ON sm.fk_exam_id=exam.id LEFT JOIN `stu_reg_log_association` `st` ON  st.fk_stu_id=sm.fk_student_id LEFT JOIN `student_info` `si` ON  si.stu_id=sm.fk_student_id LEFT JOIN `ref_group` `g` ON g.group_id=exam.fk_group_id LEFT JOIN `ref_section` `s` ON s.class_id=exam.fk_class_id INNER JOIN `user` `u` ON u.id=si.user_id WHERE (`et`.`id`='155') AND (`exam`.`fk_branch_id`=1) AND (`st`.`current_class_id`='17') AND (`st`.`current_group_id` IS NULL) AND (`st`.`current_section_id`='39') AND (`si`.`is_active`=1) GROUP BY `st`.`fk_stu_id`
---
    public function actionStdDmcPast(){
        if(Yii::$app->request->isAjax){

            $dataUnserialized = parse_str(Yii::$app->request->post('data'), $serialize_data);
            //echo '<pre>';print_r(Yii::$app->request->post('data'));die;
            $class_id = $serialize_data['class_id'];
            $group_id = $serialize_data['group_id'];
            $section_id = $serialize_data['section_id'];
            $exam = $serialize_data['Exam']['fk_exam_type'];
            $status = 0;
            $tabId = '';
            $details_html='';
            if($serialize_data['tab_type']=='#Single-Examination'){

                $examid =  $exam[1];
                $tabId = 'Single-Examination';
                /*total students in class*/
                $students= StudentInfo::find()
                    ->select(['student_info.stu_id','student_info.is_active','u.username roll_no','u.id user_id'])
                    ->innerJoin('user u','u.id=student_info.user_id')
                    ->innerJoin('stu_reg_log_association st',' st.fk_stu_id=student_info.stu_id')
                    ->where(['student_info.fk_branch_id'=>Yii::$app->common->getBranch(),'st.current_class_id'=>$class_id,'st.current_group_id'=>($group_id)?$group_id:null,'st.current_section_id'=>$section_id])
                    ->asArray()
                    ->all();
                       $exams_students = Exam::find()
                    ->select([
                        'si.stu_id','si.is_active','concat(u.first_name," ",u.middle_name," ",u.last_name) student_name'
                    ])
                    ->innerJoin('exam_type et','et.id=exam.fk_exam_type')
                    ->innerJoin('ref_class c','c.class_id=exam.fk_class_id')
                    ->innerJoin('subjects sb','sb.id=exam.fk_subject_id')
                    ->leftJoin('student_marks sm','sm.fk_exam_id=exam.id')
                    ->leftJoin('stu_reg_log_association st',' st.fk_stu_id=sm.fk_student_id')
                    ->leftJoin('student_info si',' si.stu_id=sm.fk_student_id')
                    ->leftJoin('ref_group g','g.group_id=exam.fk_group_id')
                    ->leftJoin('ref_section s','s.class_id=exam.fk_class_id')
                    ->innerJoin('user u','u.id=si.user_id')
                    ->where(['et.id'=>$examid,'exam.fk_branch_id'=>Yii::$app->common->getBranch(),'st.current_class_id'=>$class_id,'st.current_group_id'=>($group_id)?$group_id:null,'st.current_section_id'=>$section_id,'si.is_active'=>1])
                    ->groupBy(['st.fk_stu_id'])
                    ->asArray()
                    ->all();

SELECT `st`.`stu_id`, `st`.`is_active`, concat(u.first_name," ",u.last_name) student_name, `c`.`class_id`, `c`.`title`, `g`.`group_id`, `g`.`title`, `s`.`section_id`, `s`.`title`, `sb`.`title` AS `subject`, sum(exam.total_marks) total_marks, sum(exam.passing_marks) passing_marks, round(sum(sm.marks_obtained),2) marks_obtained FROM `exam` INNER JOIN `exam_type` `et` ON et.id=exam.fk_exam_type INNER JOIN `ref_class` `c` ON c.class_id=exam.fk_class_id INNER JOIN `subjects` `sb` ON sb.id=exam.fk_subject_id LEFT JOIN `student_marks` `sm` ON sm.fk_exam_id=exam.id LEFT JOIN `student_info` `st` ON  st.stu_id=sm.fk_student_id LEFT JOIN `ref_group` `g` ON g.group_id=exam.fk_group_id LEFT JOIN `ref_section` `s` ON s.class_id=exam.fk_class_id INNER JOIN `user` `u` ON u.id=st.user_id WHERE (`et`.`id` IN ('155', '')) AND (`exam`.`fk_branch_id`=1) AND (`c`.`class_id`='17') AND (`g`.`group_id` IS NULL) AND (`s`.`section_id`='39') AND (`st`.`stu_id`='909') AND (`st`.`is_active`=1) GROUP BY `st`.`stu_id`, `c`.`class_id`, `c`.`title`, `g`.`group_id`, `g`.`title`, `s`.`section_id`, `s`.`title`, `sb`.`title`
---
                                'st.stu_id',
                                'st.is_active',
                                'concat(u.first_name," ",u.last_name) student_name',
                                'c.class_id',
                                'c.title',
                                'g.group_id',
                                'g.title',
                                's.section_id',
                                's.title',
                                'sb.title subject',
                                'sum(exam.total_marks) total_marks',
                                'sum(exam.passing_marks) passing_marks',
                                'round(sum(sm.marks_obtained),2) marks_obtained'
                            ])
                            ->innerJoin('exam_type et','et.id=exam.fk_exam_type')
                            ->innerJoin('ref_class c','c.class_id=exam.fk_class_id')
                            ->innerJoin('subjects sb','sb.id=exam.fk_subject_id')
                            ->leftJoin('student_marks sm','sm.fk_exam_id=exam.id')
                            ->leftJoin('student_info st',' st.stu_id=sm.fk_student_id')
                            ->leftJoin('ref_group g','g.group_id=exam.fk_group_id')
                            ->leftJoin('ref_section s','s.class_id=exam.fk_class_id')
                            ->innerJoin('user u','u.id=st.user_id')
                            ->where(['et.id'=>$exam,'exam.fk_branch_id'=>Yii::$app->common->getBranch(),'c.class_id'=>$class_id,'g.group_id'=>($group_id)?$group_id:null,'s.section_id'=>$section_id,'st.stu_id'=>$stu_id['stu_id'],'st.is_active'=>1 ])
                            ->groupBy(['st.stu_id','c.class_id','c.title','g.group_id','g.title','s.section_id','s.title','sb.title'])->asArray()->all();