controllers/FeeController.php

SELECT * FROM `student_parents_info` WHERE `stu_id`='540'
SELECT COUNT(*) FROM `student_parents_info` WHERE `cnic`='15307-0966868-3'
SELECT * FROM `fee_group` WHERE (`fk_branch_id`=1) AND (`fk_class_id`='14') AND (`fk_group_id` IS NULL)
---
    public function actionGenerateStudentFee(){
        //$diff= 1;
         $diff=yii::$app->request->post('diff');
        $data=Yii::$app->request->post();

        $student_id= $data['stu_id'];
        $class_id = $data['classid'];
        $group_id = $data['groupid'];
        $section_id = $data['sectionid'];
        $parent_cnic = '';
        $cnic_count = 0;
        if(empty($data['Fromdate'])){
            $Fromdate = date('Y-m-01');
        }else{
            $Fromdate = $data['Fromdate'];
        }
        $studentParentInfo =  \app\models\StudentParentsInfo::find()->where(['stu_id'=>$student_id])->one();
        if(count($studentParentInfo)>0 && !empty($studentParentInfo->cnic)){
            $parent_cnic = $studentParentInfo->cnic;
            $cnic_count =  \app\models\StudentParentsInfo::find()->where(['cnic'=>$studentParentInfo->cnic])->count();
        }

        if(empty($data['toDate'])){
         $toDate = date('Y-m-t');
        }else{
         $toDate = $data['toDate'];
        }
        $getFeeDetails = \app\models\FeeGroup::find()
        ->where([
         'fk_branch_id'  =>Yii::$app->common->getBranch(),
         'fk_class_id'   => $class_id,
         'fk_group_id'   => ($group_id)?$group_id:null,
         ])->all();

SELECT sum(fee_arears.arears) as arears, `fh`.`title` AS `title` FROM `fee_arears` LEFT JOIN `fee_head` `fh` ON fh.id=fee_arears.fee_head_id WHERE (`fee_arears`.`status`=1) AND (`fee_arears`.`stu_id`='482')
---
            }
            /*get one time arrears details if exisist*/
            //$one_time_head_arear_details = [];
            $query_get_ontime_arears  = FeeArears::find()->select(['sum(fee_arears.arears) as arears','fh.title as title'])
            ->leftJoin('fee_head as fh', 'fh.id=fee_arears.fee_head_id')
             ->where([
                 'fee_arears.status'=>1,
                 'fee_arears.stu_id'=>$student_id/*,
                 'fh.one_time_payment'   => 1*/
             ])->asArray()->all();

SELECT * FROM `fee_head` WHERE `id`=1
SELECT * FROM `student_parents_info` WHERE `stu_id`='1695'
---
                print_r($model->getErrors());die;
            }
            /*code for sms*/
                $feeHeadName=FeeHead::find()->where(['id'=>$key])->one();
                $feeTitle=(!empty($feeHeadName->title)?strtoupper($feeHeadName->title):null);
                $studentParentsInfo= \app\models\StudentParentsInfo::find()->where(['stu_id'=>$data['stu_id']])->one();

SELECT * FROM `sms_settings` WHERE `fk_branch_id`=1
---
            $settings = Yii::$app->common->getBranchSettings();
            $feeOnOff = $settings->fee_sms_on_off;
            if($feeOnOff == 1){
            $smsActive=\app\models\SmsSettings::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->one();

SELECT * FROM `student_info` WHERE `stu_id`='1695'
---
        }
            /*code for sms second part ends*/
         /*activate student.*/
                $student= StudentInfo::findOne($data['stu_id']);

SELECT * FROM `fee_group` WHERE (`fk_branch_id`=1) AND (`fk_class_id`='1')
---
             $this->layout = 'pdf';
             //$mpdf = new mPDF('', 'A4');
             $mpdf = new mPDF('','', 0, '', 2, 2, 3, 3, 2, 2, 'A4');
             $getFeeDetails = \app\models\FeeGroup::find()
                 ->where([
                     'fk_branch_id'  =>Yii::$app->common->getBranch(),
                     'fk_class_id'   => $class_id,
                 ]);

SELECT * FROM `student_parents_info` WHERE `stu_id` IN ('2286', '1', '2440', '15302-0958682-1')
SELECT COUNT(*) FROM `student_parents_info` WHERE `cnic`='15307-7396193-1'
---

                /*if all head is in full disount then skip that students code new ends*/
                    //fee challan will generate here
                $studentParentInfo =  \app\models\StudentParentsInfo::find()->where(['stu_id'=>$student_id])->one();
                /*check student siblings.*/
                if(count($studentParentInfo)>0 && !empty($studentParentInfo->cnic)){
                    $parent_cnic = $studentParentInfo->cnic;
                    $cnic_count =  \app\models\StudentParentsInfo::find()->where(['cnic'=>$studentParentInfo->cnic])->count();

SELECT `year_month_interval` FROM `fee_submission` WHERE (`stu_id`=2286) AND (`branch_id`=1) AND (`fee_head_id`=1)
---
                foreach ($totalFeeDetails as $key => $getFeeDetails) {
                     $fromConvert = date('Y-m', strtotime($Fromdate));
                     $toConvert = date('Y-m', strtotime($toDate));
                     $getDateFeesCount = \app\models\FeeSubmission::find()->select(['year_month_interval'])->where(['stu_id' => intval($student_id['stu_id']), 'branch_id' => yii::$app->common->getBranch(), 'fee_head_id' => $getFeeDetails->fk_fee_head_id])->asArray()->all();