controllers/FeeSubmissionController.php

    public function actionTransportEditForm($id)
    {
      $model =FeeSubmission::findOne($id);
---
SELECT * FROM `fee_submission` WHERE `id`='25578'