controllers/ReportsController.php

SELECT `transport_allocation`.*, `si`.`user_id`, `si`.`class_id`, `si`.`group_id`, `si`.`section_id`, CONCAT(user.first_name," ",user.last_name) as student_name, `spi`.`first_name` AS `parent_name`, `spi`.`contact_no` AS `father_contact`, `s`.`title` AS `stop_name`, `s`.`fare`, `r`.`title` AS `route_name`, `z`.`title` AS `zone_name`, `allot`.`discount_amount` FROM `transport_allocation` INNER JOIN `student_info` `si` ON transport_allocation.stu_id=si.user_id INNER JOIN `user` ON user.id=si.user_id INNER JOIN `student_parents_info` `spi` ON spi.stu_id=si.stu_id INNER JOIN `stop` `s` ON s.id=transport_allocation.fk_stop_id INNER JOIN `route` `r` ON r.id=s.fk_route_id INNER JOIN `zone` `z` ON z.id=r.fk_zone_id INNER JOIN `transport_allocation` `allot` ON allot.stu_id=si.user_id WHERE (`si`.`fk_branch_id`=1) AND (`si`.`is_active`=1) AND (`transport_allocation`.`fk_stop_id`='1')
---
    public function actionGetstudentStopwise(){
        $stop_id=yii::$app->request->post('stopid');
        // $getStopStudent=\app\models\TransportAllocation::find()->where(['fk_stop_id'=>$stop_id,'branch_id'=>yii::$app->common->getBranch()])->all();
        $getStopStudent= \app\models\TransportAllocation::find()
                    ->select(['transport_allocation.*','si.user_id','si.class_id','si.group_id','si.section_id','CONCAT(user.first_name," ",user.last_name) as student_name','spi.first_name as parent_name','spi.contact_no as father_contact','s.title as stop_name','s.fare','r.title as route_name','z.title as zone_name','allot.discount_amount'])
                    ->innerJoin('student_info si','transport_allocation.stu_id=si.user_id')
                    ->innerJoin('user','user.id=si.user_id')
                    ->innerJoin('student_parents_info spi','spi.stu_id=si.stu_id')
                    ->innerJoin('stop s','s.id=transport_allocation.fk_stop_id')
                    ->innerJoin('route r','r.id=s.fk_route_id')
                    ->innerJoin('zone z','z.id=r.fk_zone_id')
                    ->innerJoin('transport_allocation allot','allot.stu_id=si.user_id')
                    ->where(['si.fk_branch_id'=>Yii::$app->common->getBranch(),'si.is_active'=>1,'transport_allocation.fk_stop_id'=>$stop_id])

SELECT * FROM `fee_submission` WHERE `recv_date`='2020-09-23'
---
      public function actionTodayRcv(){
      	if(!isset($_GET['class_id'])){
      	$todayFeeRcv=FeeSubmission::find()->where(['recv_date'=>date('Y-m-d'),'fee_status'=>1])->all();
      	return $todayFeeView = $this->render('finance/today-recv',['todayFeeRcv'=>$todayFeeRcv]);
      	}else{
	   $class_id=yii::$app->request->get('class_id');
	   $todayFeeRcv=FeeSubmission::find()->where(['recv_date'=>date('Y-m-d'),'fee_status'=>1])->all();

SELECT COUNT(*) FROM `student_leave_info` WHERE `created_date` LIKE '%2020%'
---
      public function actionLeaveSchool(){
        $year=yii::$app->request->post('years');
        $leaveInfo=StudentLeaveInfo::find()->where(['like','created_date',$year])->count();

SELECT * FROM `student_leave_info` WHERE (`class_id`='17') AND (`created_date` LIKE '%2020%')
---
     public function actionLeaveScholClassStudent(){
         $year=yii::$app->request->post('years');
         $clas=yii::$app->request->post('clas');
       $leaveInfo=StudentLeaveInfo::find()->where(['class_id'=>$clas])->andWhere(['like','created_date',$year])->all();

SELECT * FROM `student_leave_info` WHERE `stu_id`='441'
---
     public function actionSlcSlip(){
        $id = Yii::$app->request->get('id');
        $levInfo=StudentLeaveInfo::find()->where(['stu_id'=>$id])->one();

SELECT * FROM `sms_log` WHERE (date(sent_date_time)='2020-10-14') AND (`status` NOT LIKE '%SMS successfully Sent.%')
---
    public function actionFailedSms(){
        $smsLog=\app\models\SmsLog::find()->where(['date(sent_date_time)'=>date('Y-m-d')])->andWhere(['NOT like','status','SMS successfully Sent.'])->all();