controllers/SiteController.php

SELECT * FROM `dashboard` WHERE `fk_branch_id`=1
SELECT * FROM `student_info` WHERE `user_id`=940
SELECT count(*) as total, `student_attendance`.`leave_type` FROM `student_attendance` INNER JOIN `student_info` `si` ON si.stu_id=student_attendance.fk_stu_id WHERE (`si`.`fk_branch_id`=1) AND (date(student_attendance.date)='2020-11-21') AND (`si`.`is_active`=1) GROUP BY `student_attendance`.`leave_type`
SELECT count(*) as total, `employee_attendance`.`leave_type` FROM `employee_attendance` INNER JOIN `employee_info` `ei` ON ei.emp_id=employee_attendance.fk_empl_id WHERE (`ei`.`fk_branch_id`=1) AND (date(employee_attendance.date)='2020-11-21') AND (`ei`.`is_active`=1) GROUP BY `employee_attendance`.`leave_type`
---
     public function actionDashboard()
    {
                $dashboard = Dashboard::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()/*,'status'=>1*/])->all();
                $student=\app\models\StudentInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
                /*student daily attendance*/
               $attendance_std_query = \app\models\StudentAttendance::find()
                    ->select(['count(*) as total','student_attendance.leave_type'])
                    ->innerJoin('student_info si','si.stu_id=student_attendance.fk_stu_id')
                    ->where(['si.fk_branch_id'=>Yii::$app->common->getBranch(),'date(student_attendance.date)'=>date('Y-m-d'),'si.is_active'=>1])
                    ->groupBy('student_attendance.leave_type')
                    ->asArray()
                    ->all();
                /*student attedance array*/
                $attenance_std_data=[];
                foreach ($attendance_std_query as $key=>$attendance_details){
                    $attenance_std_data['leave_type'][]= $attendance_details['leave_type'];
                    $attenance_std_data['total'][]= $attendance_details['total'];

                }
                //print_r($attenance_std_data);die;
                /*employee daily attendance*/
                $attendance_emp_query = \app\models\EmployeeAttendance::find()
                    ->select(['count(*) as total','employee_attendance.leave_type'])
                    ->innerJoin('employee_info ei','ei.emp_id=employee_attendance.fk_empl_id')
                    ->where([
                        'ei.fk_branch_id'=>Yii::$app->common->getBranch(),
                        'date(employee_attendance.date)'=>date('Y-m-d'),
                        'ei.is_active'=>1
                    ])
                    ->groupBy('employee_attendance.leave_type')
                    ->asArray()
                    ->all();

SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')
---
                    $attenance_emp_data['total'][]= $attendance_emp_details['total'];

                }
                $class=RefClass::find()->where(['fk_branch_id'=>yii::$app->common->getBranch(),'status'=>'active'])->all();

SELECT COUNT(*) FROM `fee_submission` WHERE `from_date` LIKE '%2020%'
---
                 $year = date('Y');
                //$year = '2017';
                $years = [1=>'Jan',2=>'Feb',3=>'Mar',4=>'Apr',5=>'May',6=>'Jun',7=>'Jul',8=>'Aug',9=>'Sep',10=>'Oct',11=>'Nov',12=>'Dec'];
                $count_year_available = \app\models\FeeSubmission::find()->where(['like','from_date',$year,'stu_id'=>$student->stu_id])->count();

SELECT sum(head_recv_amount) total_amount_receive, sum(transport_amount) transport_amount_rcv, sum(hostel_amount) hostel_amount_rcv, `year_month_interval` FROM `fee_submission` WHERE (`from_date`='2020-01') AND (`stu_id`=939)
SELECT SUM(amount) FROM `fee_arrears_rcv` WHERE stu_id='939' and from_date like '2020-01%'
---
                        }

                       // echo $year_month;die;
                        $query =  \app\models\FeeSubmission::find()
                        ->select('sum(head_recv_amount) total_amount_receive,sum(transport_amount) transport_amount_rcv,sum(hostel_amount) hostel_amount_rcv,year_month_interval')
                        ->where(['from_date'=>$year_month,'stu_id'=>$student->stu_id])->asArray()->one();
                        $where="stu_id='".$student->stu_id."' and from_date like '".$year_month."%'";
                        $fee_arrears_rcv=\app\models\FeeArrearsRcv::find()->where($where)->sum('amount');

SELECT SUM(head_recv_amount + transport_amount + hostel_amount + absent_fine) FROM `fee_submission` WHERE (`branch_id`=1) AND (`stu_id`=939)
SELECT SUM(amount) FROM `fee_arrears_rcv` WHERE (`branch_id`=1) AND (`stu_id`=939)
SELECT SUM(arears) FROM `fee_arears` WHERE (`branch_id`=1) AND (`stu_id`=939) AND (`status`=1)
SELECT SUM(transport_arrears+hostel_arrears) FROM `fee_submission` WHERE (`branch_id`=1) AND (`stu_id`=939) AND (`fee_status`=1)
SELECT sum(head_recv_amount) total_amount_receive, sum(transport_amount) transport_amount_rcv, sum(hostel_amount) hostel_amount_rcv, sum(absent_fine) absent_fine_rcv, `from_date`, `to_date` FROM `fee_submission` WHERE (`stu_id`=939) AND (`branch_id`=1) AND (`fee_status`=1)
SELECT * FROM `student_attendance` WHERE (`fk_stu_id`=939) AND (date(date)='2020-11-21')
SELECT * FROM `sms_settings` WHERE `fk_branch_id`=1
---
                sum(if(leave_type='leave',1,0)) AS `leaveCount` FROM student_attendance where fk_stu_id='".$student->stu_id."' and `date` ='".$attdays."'")->queryAll();
                  $attendance_detail_array[$attdays]=$studentAttendanceQueryThirtyDays[0];
             }
           $totalFeeCollected=\app\models\FeeSubmission::find()->where(['branch_id'=>yii::$app->common->getBranch(),'stu_id'=>$student->stu_id])->sum('head_recv_amount + transport_amount + hostel_amount + absent_fine');
            $fee_arrears_rcv=\app\models\FeeArrearsRcv::find()->where(['branch_id'=>yii::$app->common->getBranch(),'stu_id'=>$student->stu_id])->sum('amount');
            $totalArrear=\app\models\FeeArears::find()->where(['branch_id'=>yii::$app->common->getBranch(),'stu_id'=>$student->stu_id,'status'=>1])->sum('arears');
            $totalFeeSumissionArrears=\app\models\FeeSubmission::find()->where(['branch_id'=>yii::$app->common->getBranch(),'stu_id'=>$student->stu_id,'fee_status'=>1])->sum('transport_arrears+hostel_arrears');

             $previousFeeTakenMonth =  \app\models\FeeSubmission::find()
                        ->select('sum(head_recv_amount) total_amount_receive,sum(transport_amount) transport_amount_rcv,sum(hostel_amount) hostel_amount_rcv,sum(absent_fine) absent_fine_rcv,from_date,to_date')->where(['stu_id'=>intval($student->stu_id),'branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->asArray()->one();
                        /*today attendance query*/
              $today_attendance=\app\models\StudentAttendance::find()->where(['fk_stu_id'=>$student->stu_id,'date(date)'=>date("Y-m-d")])->one();

            $smssettings=\app\models\SmsSettings::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->one();

SELECT * FROM `student_info` WHERE `user_id`=1571
SELECT * FROM `employee_info` WHERE `user_id`=1571
SELECT * FROM `dashboard` WHERE `fk_branch_id`=1
SELECT count(*) as total, `student_attendance`.`leave_type` FROM `student_attendance` INNER JOIN `student_info` `si` ON si.stu_id=student_attendance.fk_stu_id WHERE (`si`.`fk_branch_id`=1) AND (date(student_attendance.date)='2021-01-25') AND (`si`.`is_active`=1) GROUP BY `student_attendance`.`leave_type`
SELECT count(*) as total, `employee_attendance`.`leave_type` FROM `employee_attendance` INNER JOIN `employee_info` `ei` ON ei.emp_id=employee_attendance.fk_empl_id WHERE (`ei`.`fk_branch_id`=1) AND (date(employee_attendance.date)='2021-01-25') AND (`ei`.`is_active`=1) GROUP BY `employee_attendance`.`leave_type`
---
    public function actionAccountDashboard(){
      if(!Yii::$app->user->isGuest){
            $studentInfo = \app\models\StudentInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
            $EmployeeInfo = \app\models\EmployeeInfo::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();
                $dashboard = Dashboard::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()/*,'status'=>1*/])->all();

                /*student daily attendance*/
                $attendance_std_query = \app\models\StudentAttendance::find()
                    ->select(['count(*) as total','student_attendance.leave_type'])
                    ->innerJoin('student_info si','si.stu_id=student_attendance.fk_stu_id')
                    ->where(['si.fk_branch_id'=>Yii::$app->common->getBranch(),'date(student_attendance.date)'=>date('Y-m-d'),'si.is_active'=>1])
                    ->groupBy('student_attendance.leave_type')
                    ->asArray()
                    ->all();
                /*student attedance array*/
                $attenance_std_data=[];
                foreach ($attendance_std_query as $key=>$attendance_details){
                    $attenance_std_data['leave_type'][]= $attendance_details['leave_type'];
                    $attenance_std_data['total'][]= $attendance_details['total'];

                }
                //print_r($attenance_std_data);die;
                /*employee daily attendance*/
                $attendance_emp_query = \app\models\EmployeeAttendance::find()
                    ->select(['count(*) as total','employee_attendance.leave_type'])
                    ->innerJoin('employee_info ei','ei.emp_id=employee_attendance.fk_empl_id')
                    ->where([
                        'ei.fk_branch_id'=>Yii::$app->common->getBranch(),
                        'date(employee_attendance.date)'=>date('Y-m-d'),
                        'ei.is_active'=>1
                    ])
                    ->groupBy('employee_attendance.leave_type')
                    ->asArray()
                    ->all();

SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')
---
                    $attenance_emp_data['total'][]= $attendance_emp_details['total'];

                }
                $class=RefClass::find()->where(['fk_branch_id'=>yii::$app->common->getBranch(),'status'=>'active'])->all();

SELECT COUNT(*) FROM `fee_submission` WHERE `from_date` LIKE '%2021%'
---
                 $year = date('Y');
                //$year = '2017';
                $years = [1=>'Jan',2=>'Feb',3=>'Mar',4=>'Apr',5=>'May',6=>'Jun',7=>'Jul',8=>'Aug',9=>'Sep',10=>'Oct',11=>'Nov',12=>'Dec'];
                $count_year_available = \app\models\FeeSubmission::find()->where(['like','from_date',$year])->count();

SELECT sum(head_recv_amount) total_amount_receive, sum(transport_amount) transport_amount_rcv, sum(hostel_amount) hostel_amount_rcv, `year_month_interval` FROM `fee_submission` WHERE `from_date`='2021-01'
SELECT SUM(amount) FROM `fee_arrears_rcv` WHERE from_date like '2021-01%'
---
                            $year_month = $year.'-'.sprintf("%02d", $key);
                        }
                       // echo $year_month;die;
                        $query =  \app\models\FeeSubmission::find()
                        ->select('sum(head_recv_amount) total_amount_receive,sum(transport_amount) transport_amount_rcv,sum(hostel_amount) hostel_amount_rcv,year_month_interval')
                        ->where(['from_date'=>$year_month])->asArray()->one();
                        $where="from_date like '".$year_month."%'";
                        $fee_arrears_rcv=\app\models\FeeArrearsRcv::find()->where($where)->sum('amount');

SELECT SUM(head_recv_amount + transport_amount + hostel_amount + absent_fine) FROM `fee_submission` WHERE `branch_id`=1
SELECT SUM(amount) FROM `fee_arrears_rcv` WHERE `branch_id`=1
SELECT SUM(arears) FROM `fee_arears` WHERE (`branch_id`=1) AND (`status`=1)
SELECT SUM(transport_arrears+hostel_arrears) FROM `fee_submission` WHERE (`branch_id`=1) AND (`fee_status`=1)
SELECT * FROM `sms_settings` WHERE `fk_branch_id`=1
SELECT SUM(head_recv_amount) FROM `fee_submission` WHERE (`branch_id`=1) AND (date(recv_date)='2021-01-25')
---
                sum(if(leave_type='leave',1,0)) AS `leaveCount` FROM employee_attendance where `date` ='".$empDays."'")->queryAll();
                 $empl_att_array[$empDays]=$empAttendQuery[0];
             }
            $totalFeeCollected=\app\models\FeeSubmission::find()->where(['branch_id'=>yii::$app->common->getBranch()])->sum('head_recv_amount + transport_amount + hostel_amount + absent_fine');
            $fee_arrears_rcv=\app\models\FeeArrearsRcv::find()->where(['branch_id'=>yii::$app->common->getBranch()])->sum('amount');
            $totalArrear=\app\models\FeeArears::find()->where(['branch_id'=>yii::$app->common->getBranch(),'status'=>1])->sum('arears');
            $totalFeeSumissionArrears=\app\models\FeeSubmission::find()->where(['branch_id'=>yii::$app->common->getBranch(),'fee_status'=>1])->sum('transport_arrears+hostel_arrears');
            $smssettings=\app\models\SmsSettings::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->one();
            $todayFeeRcv = \app\models\FeeSubmission::find();
               $todayFeeRcv->where(['branch_id'=>Yii::$app->common->getBranch(),'date(recv_date)'=>date('Y-m-d'),'fee_status'=>1]);
               $todayheadAmount = $todayFeeRcv->sum('head_recv_amount');

SELECT SUM(amount) FROM `expenses` WHERE `fk_branch_id`=1
SELECT SUM(absent_fine) FROM `fee_submission` WHERE `branch_id`=1
---
               $todayHostelAmount = $todayFeeRcv->sum('hostel_amount');
               $todayAbsentAmount = $todayFeeRcv->sum('absent_fine');
               $todayFeeCollected=$todayheadAmount + $todayTranportAmount +$todayHostelAmount + $todayAbsentAmount;
                $totalExpenses=\app\models\Expenses::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->sum('amount');
                $totalAbsenFine=\app\models\FeeSubmission::find()->where(['branch_id'=>yii::$app->common->getBranch()])->sum('absent_fine');

INSERT INTO `user_log` (`user_id`, `country`, `ip_address`, `browser`, `version`, `platform`, `login_date_time`) VALUES (1573, 'PK', '39.33.109.45', 'Google Chrome', '85.0.4183.83', 'windows', '2020-09-04 08:24:44')
---
    public function actionLogin()
    {

        $this->layout = 'login';

        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())) {

            if($model->login()){
                $client_Ip= Yii::$app->common->get_client_ip();
                $browser_details= Yii::$app->common->getBrowser();
                $user_log = new UserLog();
                $user_log->user_id =Yii::$app->user->id;
                 $user_log->country = 'PK';
                $user_log->ip_address  = (!empty($client_Ip))?$client_Ip:null;
                $user_log->browser=$browser_details['name'];
                $user_log->version = (!empty($browser_details['version']))?$browser_details['version']:null;
                $user_log->platform = (!empty($browser_details['platform']))?$browser_details['platform']:null;
                $user_log->login_date_time = date('Y-m-d H:i:s');
                if(!$user_log->save()){

SELECT * FROM `user_log` WHERE `user_id`=598 ORDER BY `id` DESC
DELETE FROM `user_log` WHERE `id`=1509
---
    public function actionLogout()
    {
        $userlog = UserLog::find()->where(['user_id'=>\Yii::$app->user->id])->orderBy(['id'=>SORT_DESC])->one();
        if( $userlog) {
           $userlog->delete();

SELECT COUNT(*) FROM `ref_group` WHERE (`fk_class_id`='4') AND (`fk_branch_id`=1) AND (`status`='active')
---
    public function actionGetSection()
    {
        $group_id = Yii::$app->request->post('depdrop_all_params')['group-id'];
        $class_id = Yii::$app->request->post('depdrop_all_params')['class-id'];
        if (!empty($class_id) && $group_id=='Loading ...') {
            $count_group = RefGroup::find()->where(['fk_class_id'=>$class_id,'fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->count();
            if($count_group ==0){
                $out = Yii::$app->common->getSection($class_id,Null);
                return   Json::encode(['output'=>$out, 'selected'=>'']);
            }else{
                return false;
            }
        }
        elseif(!empty($class_id) && !empty($group_id)){
            $out = Yii::$app->common->getSection($class_id,$group_id);
            return   Json::encode(['output'=>$out, 'selected'=>'']);
        } else{
            $count_group = RefGroup::find()->where(['fk_class_id'=>$class_id,'fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->count();