controllers/StudentController.php

SELECT * FROM `fee_group` WHERE (`fk_branch_id`=1) AND (`fk_class_id`=15) AND (`fk_group_id` IS NULL)
---
                ->where([
                  'exam.fk_branch_id'=>Yii::$app->common->getBranch(),
                  'exam.fk_class_id'=>$studentInfo->class_id,
                  'exam.fk_group_id'=>($studentInfo->group_id)?$studentInfo->group_id:null,