controllers/UserController.php

    public function actionProfile(){
        $model=new User();
        $id=yii::$app->user->identity->id;
        $loginUser=User::find()->where(['id'=>$id])->one();
---
SELECT * FROM `user` WHERE `id`=1755