views/reports/finance/today-recv.php

SELECT * FROM `fee_head` WHERE (`branch_id`=1) AND (`id`=1)
---
        $i++;
        $total_amount+=$todayFee_rcv->head_recv_amount;
        $totaltransportAmnt+=$todayFee_rcv->transport_amount;
        $getHead=\app\models\FeeHead::find()->where(['branch_id'=>yii::$app->common->getBranch(),'id'=>$todayFee_rcv->fee_head_id])->one();