views/student/_ajax/date-report.php

          <?php foreach ($list as $key => $getDate) {?>

           <td><?php
           $attendance=\app\models\StudentAttendance::find()->where(['fk_stu_id'=>$stuQuery['stu_id'],'date'=>$getDate])->one();?>
---
SELECT * FROM `student_attendance` WHERE (`fk_stu_id`='1820') AND (`date`='2020-09-01')