components/CommonHelper.php

SELECT * FROM `branch` WHERE `id`=FALSE
---
     public static function getBranchDetail()
    {
        $branch = Branch::find()->where(['id'=>Yii::$app->common->getBranch()])->One();

SELECT `group_id` AS `id`, `title` AS `name` FROM `ref_group` WHERE (`fk_class_id`='19') AND (`fk_branch_id`=1) AND (`status`='active')
---
    public static function getGroup($class_id) {
        $data=RefGroup::find()->select(['group_id as id','title as name'])->where(['fk_class_id'=>$class_id,'fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active']) ->asArray()->all();

SELECT `section_id` AS `id`, `title` AS `name` FROM `ref_section` WHERE (`class_id`='4') AND (`fk_group_id` IS NULL) AND (`fk_branch_id`=1) AND (`status`='active')
---
    public static function getSection($class_id,$group_id = null) {
        $data=RefSection::find()->select(['section_id as id','title as name'])->where(['class_id'=>$class_id,'fk_group_id'=>$group_id,'fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->asArray()->all();

SELECT * FROM `user` WHERE `id`=598
---
        public static function getName($id)
    {
        $name = User::find()->where(['id'=>$id])->One();

SELECT * FROM `user` WHERE `id`=95
---
     public static function getUserName($id)
    {
        $name = User::find()->where(['id'=>$id])->One();

SELECT * FROM `student_parents_info` WHERE `stu_id`=597
---
    public static function getParentName($id)
    {
        $name = StudentParentsInfo::find()->where(['stu_id'=>$id])->one();

SELECT * FROM `student_info` WHERE (`fk_branch_id`=1) AND (`stu_id`='597')
---
    public static  function getStudent($id){
        $student = \app\models\StudentInfo::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'stu_id'=>$id])->one();

SELECT * FROM `student_info` WHERE (`fk_branch_id`=1) AND (`user_id`='1187')
---
    public static  function getStudentByUserId($id){
        $studentUser = \app\models\StudentInfo::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'user_id'=>$id])->one();

SELECT * FROM `user` WHERE `id`=272
---
    public static  function getUserTable($id){
        $user_table = \app\models\User::find()->where(['id'=>$id])->one();

SELECT * FROM `settings` WHERE `fk_branch_id`=1
---
    public static function getBranchSettings(){
        $settings = Settings::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()])->One();

SELECT * FROM `dashboard_setting` WHERE `fk_branch_id`=1
---
    public static function getDashboardSettings(){
        $dashobardSetting = DashboardSetting::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()])->One();

SELECT * FROM `sms_settings` WHERE `fk_branch_id`=1
INSERT INTO `sms_log` (`SMS_body`, `fk_user_id`, `fk_branch_id`, `sent_date_time`, `receiver_no`, `status`) VALUES ('Fee submission details of: SARA NOOR\\nMONTHLY FEE : Rs. 1440, \\nANNUAL FUND : Rs. 0, \\n', 1695, 1, '2020:10:30 11:21:41', '923429503438', 'Your Message is sent, MSISDN 1, Cost 1')
---
    public static function SendSms($mbl,$msg,$studentId){
        $message = urlencode('Alhuda Ouch: '.$msg);
        $smsSet=SmsSettings::find()->where(['fk_branch_id'=>yii::$app->common->getBranch()])->one();
        $smsModel=new SmsLog();
        $mask=$smsSet->mask;
 $url="https://sms.lrt.com.pk/api/sms-single-or-bulk-api.php?username=Kryptons&password=c42af05519d1230f1e5f75c87&apikey=899a23495cbee1821894813d2ad8b341&sender=8023&phone=".$mbl."&type=English&message=".$message;
      //   $url = "https://www.hajanaone.com/api/sendsms.php?apikey=DNK43XGFQ6aN&phone=".$mbl."&sender=".$mask."&message=".$message;

        $ch  =  curl_init();
            $timeout  =  30;
            curl_setopt ($ch,CURLOPT_URL, $url) ;
            curl_setopt ($ch,CURLOPT_RETURNTRANSFER, 1);
            curl_setopt ($ch,CURLOPT_CONNECTTIMEOUT, $timeout) ;
            $response = curl_exec($ch) ;
            curl_close($ch);
       $smsModel->SMS_body=$msg;
       $useri=$smsModel->fk_user_id=$studentId;
       $smsModel->fk_branch_id=yii::$app->common->getBranch();
       $smsModel->sent_date_time=date("Y:m:d H:i:s");
       $smsModel->receiver_no=$mbl;
       // echo $response; die;
       $smsModel->status=$response;
            if ($smsModel->save()) {

SELECT * FROM `ref_class` WHERE `class_id`=1
---
    public static function getStudentCGSection($student_id){
            /*get std details*/
        $student = Yii::$app->common->getStudent($student_id);
        if($student){
            $CGS = $student->class->title;

            if($student->group_id){
                $CGS .= '-'.$student->group->title;

SELECT `title` FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`class_id`='12')
SELECT `title` FROM `ref_group` WHERE (`fk_branch_id`=1) AND (`group_id` IS NULL)
SELECT `title` FROM `ref_section` WHERE (`fk_branch_id`=1) AND (`section_id`='25')
---
    public static function getCGSName($class_id,$group_id=null,$section){
        $classtitle = RefClass::find()->select(['title'])->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'class_id'=>$class_id])->one();
        $grouptitle = RefGroup::find()->select(['title'])->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'group_id'=>($group_id)?$group_id:null])->one();
        $sectiontitle = RefSection::find()->select(['title'])->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'section_id'=>$section])->one();