views/site/calendrevent.php

         $('#modalBody').html(event.description);
         $('#fullCalModal').modal();
     },
      events: [
      <?php $notices=Noticeboard::find()->all();
      foreach($notices as $row):

      ?>
        {
          title: '<?= $row->title;?>',
          start: '<?= $row->date;?>',
          end: '<?php
      //$date = strtotime("+1 day");
       echo $row->end_date .'T24:00:00';

          ?>',
          color: '#257e4a'
        },
        <?php endforeach ?>

      ]
    });
---
SELECT * FROM `noticeboard`