views/site/login.php

use yii\helpers\Html;
use yii\helpers\Url;
use yii\bootstrap\ActiveForm;
$colors=\app\models\Colors::find()->one();
---
SELECT * FROM `colors`