views/analysis/get-section-analysis.php

                        [
                            'label'     =>'Student Registration No.',
                            'value'     => function($data){
                                $userName=\app\models\User::find()->where(['id'=>$data->user_id])->One();
---
SELECT * FROM `user` WHERE `id`=207

                        [
                            'label'=>'Contact',
                            'value' =>function($data,$key){
                             $p_contact = StudentParentsInfo::find()->where(['stu_id'=>$key])->one();
---
SELECT * FROM `student_parents_info` WHERE `stu_id`=206

                        [
                            'label'=>'CNIC',
                            'value' =>function($data,$key){
                             $p_contact = StudentParentsInfo::find()->where(['stu_id'=>$key])->one();
---
SELECT * FROM `student_parents_info` WHERE `stu_id`=206