views/analysis/index.php

SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')
---
use app\models\RefGroup;
$this->title = 'Class Summary';

$class_array = ArrayHelper::map(\app\models\RefClass::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->all(), 'class_id', 'title');