views/analysis/section-pdf.php

use yii\widgets\LinkPager;
use app\models\StudentInfo;
use app\models\StudentParentsInfo;
$getClass=\app\models\RefClass::find()->where(['class_id'=>$class_val])->one();
$getGroup=\app\models\RefGroup::find()->where(['group_id'=>$groupval])->one();
---
SELECT * FROM `ref_class` WHERE `class_id`='4'
SELECT * FROM `ref_group` WHERE `group_id`=''

}else{
$groupname='';
}
$getSection=\app\models\RefSection::find()->where(['section_id'=>$sectionval])->one();
---
SELECT * FROM `ref_section` WHERE `section_id`='17'

'format' => 'raw',
    'contentOptions'=>['style'=>'width: 200px;'],
'value' =>function($data,$key){
   $p_contact = StudentParentsInfo::find()->where(['stu_id'=>$key])->one();
---
SELECT * FROM `student_parents_info` WHERE `stu_id`=2507

[
  'label'=>'CNIC',
  'value' =>function($data,$key){
   $p_contact = StudentParentsInfo::find()->where(['stu_id'=>$key])->one();
---
SELECT * FROM `student_parents_info` WHERE `stu_id`=2507

    'label'=>'Profession',
    'value'     => function($data){

        $profession = \app\models\Profession::find()->where(['id'=>$data->parentsInfo->profession])->one();
---
SELECT * FROM `profession` WHERE `id`='45'