views/student/attendance.php

  <?php endif; ?>
<?php
$settings = Yii::$app->common->getBranchSettings();
 $class_array = ArrayHelper::map(\app\models\RefClass::find()->where(['status'=>'active','fk_branch_id'=>Yii::$app->common->getBranch()])->all(), 'class_id', 'title'); ?>
---
SELECT * FROM `ref_class` WHERE (`status`='active') AND (`fk_branch_id`=1)