views/student/fee.php

SELECT * FROM `fee_discount_types` WHERE (`fk_branch_id`=1) AND (`is_active`=1)
---
$this->registerJsFile(Yii::getAlias('@web').'/js/jquery.steps.js',['depends' => [yii\web\JqueryAsset::className()]]);
$this->registerJsFile(Yii::getAlias('@web').'/js/custom-step.js',['depends' => [yii\web\JqueryAsset::className()]]);
$this->registerJsFile(Yii::getAlias('@web').'/js/previewstudent.js',['depends' => [yii\web\JqueryAsset::className()]]);
$discount_type= ArrayHelper::map(\app\models\FeeDiscountTypes::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'is_active'=>1])->all(),'id','title');

SELECT * FROM `fee_head` WHERE (`branch_id`=1) AND (`id`=1)
---


                //$diff = $key;
                $getHead=\app\models\FeeHead::find()->where(['branch_id'=>yii::$app->common->getBranch(),'id'=>$getFeeDetails->fk_fee_head_id])->one();