views/student/official.php

SELECT * FROM `ref_session` WHERE `fk_branch_id`=1
---
    <?php $form = ActiveForm::begin(); ?>
		<div class="row">
			<div class="col-md-6">
        <?php $session = ArrayHelper::map(RefSession::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()])->all(), 'session_id', 'title');

SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')
---
                ])->label(Yii::t('app','Session').'<span style="color:#a94442;">*</span>');
                ?>
          <?php
                    $class_array = ArrayHelper::map(\app\models\RefClass::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->all(), 'class_id', 'title');?>

SELECT * FROM `ref_group` WHERE (`fk_branch_id`=1) AND (`status`='active') AND (`fk_class_id`=19)
---
                        ?>
                        <?php
                if($model->isNewRecord!='1'){
                $group = ArrayHelper::map(RefGroup::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active','fk_class_id'=>$model->class_id])->all(), 'group_id', 'title');

SELECT * FROM `ref_section` WHERE (`fk_branch_id`=1) AND (`status`='active') AND (`class_id`=19)
---
                            $section = ArrayHelper::map(RefSection::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active','class_id'=>$model->class_id,'fk_group_id'=>$model->group_id
                        ])->all(), 'section_id', 'title');
                            }else{
                                $section = ArrayHelper::map(RefSection::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active','class_id'=>$model->class_id])->all(), 'section_id', 'title');

SELECT * FROM `ref_religion`
---

      </div> <!-- first col-md-6 -->
      <div class="col-md-6">
        <?php $religion_array = ArrayHelper::map(\app\models\RefReligion::find()->all(), 'religion_type_id', 'Title');

SELECT * FROM `ref_shift` WHERE `fk_branch_id`=1
---
                        ],
                    ])->label('Religion <span style="color:red">*</span>');?>
        <?php
                $shift = ArrayHelper::map(RefShift::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch()])->all(), 'shift_id', 'title');

SELECT * FROM `ref_countries`
---
        <?= $form->field($model, 'roll_no')->textInput()->label('Class Roll No (Optional)') ?>
        <?= $form->field($model, 'location1')->textInput(['maxlength' => true,'class'=>'form-control input','id'=>'location1'])->label('Address <span style="color:red">*</span>') ?>
        <?php
                    $country = ArrayHelper::map(RefCountries::find()->all(), 'country_id', 'country_name');

SELECT * FROM `ref_province`
---
        <?php

                    if(!$model->isNewRecord){
                        $items = ArrayHelper::map(RefProvince::find()->all(), 'province_id', 'province_name');

SELECT * FROM `ref_district`
---
                    ?>
            <?php
                    if(!$model->isNewRecord){
                        $district_array = ArrayHelper::map(\app\models\RefDistrict::find()->all(), 'district_id', 'District_Name');

SELECT * FROM `ref_cities`
---
                    ?>
                    <?php
                    if(!$model->isNewRecord){
                        $city = ArrayHelper::map(RefCities::find()->all(), 'city_id', 'city_name');