views/student/profile.php

                          <?php if($studentInfo->studentParentsInfos){
                                  $professn = $studentInfo->studentParentsInfos->profession;
                                  if($professn){
                                      $getProfession=Profession::find()->where(['id'=>$professn])->one();
---
SELECT * FROM `profession` WHERE `id`='36'

                          <?php echo ($studentInfo->location1)? strtoupper($studentInfo->location1):'N/A' ;
                          echo ' , ';
                             if(count($studentInfo->country_id) > 0){
                                  echo $studentInfo->district->District_Name.' , '.$studentInfo->city->city_name .' , '. $studentInfo->province->province_name .' , '. $studentInfo->country->country_name;}?>
---
SELECT * FROM `ref_cities` WHERE `city_id`=1537
SELECT * FROM `ref_countries` WHERE `country_id`=1
SELECT * FROM `ref_district` WHERE `district_id`=153
SELECT * FROM `ref_province` WHERE `province_id`=1

                      <th>
                    <?php
                      $student_details = Yii::$app->common->getStudent($studentInfo->stu_id);
                      $transport= \app\models\TransportAllocation::find()->where(['stu_id'=>$student_details->user_id,'status'=>1])->one();
---
SELECT * FROM `transport_allocation` WHERE (`stu_id`=598) AND (`status`=1)

                    <tr>
                      <th>
                    <?php
                                $hostel_detail  = \app\models\HostelDetail::find()->where(['fk_student_id'=>$studentInfo->stu_id])->one();
---
SELECT * FROM `hostel_detail` WHERE `fk_student_id`=597

                            $discountHead=0;
                            $total_sibling_discount = 0;
                            $transport=0;
                            $transport=\app\models\TransportAllocation::find()->where(['stu_id'=>$studentInfo->user_id,'status'=>1])->one();
---
SELECT * FROM `transport_allocation` WHERE (`stu_id`=598) AND (`status`=1)

                            //echo '<pre>';print_r($getFeeDetails);die();
                            foreach ($getFee as $key=> $feeavail) {
                            $i++;
                            $getHead=\app\models\FeeHead::find()->where(['branch_id'=>yii::$app->common->getBranch(),'id'=>$feeavail->fk_fee_head_id])->one();
                            /*if new then admission,if old then promotion*/
                            $year=date('Y');
                            $promotedData=\app\models\StuRegLogAssociation::find()->where(['fk_stu_id'=>$studentInfo->stu_id])->andWhere(['YEAR(promoted_date)'=>$year])->count();
---
SELECT * FROM `fee_head` WHERE (`branch_id`=1) AND (`id`=1)
SELECT COUNT(*) FROM `stu_reg_log_association` WHERE (`fk_stu_id`=597) AND (YEAR(promoted_date)='2020')

                            /*temporory avoid admssion fee*/
                            /*if new then admission,if old then promotion ends*/
                            $total=$total+$feeavail->amount;
                            $getDiscountPercent=\app\models\FeePlan::find()->where(['fee_head_id'=>$feeavail->fk_fee_head_id,'stu_id'=>$studentInfo->stu_id,'status'=>1])->one();
---
SELECT * FROM `fee_plan` WHERE (`fee_head_id`=1) AND (`stu_id`=597) AND (`status`=1)

                      $currentDate=date('Y-m-d');
                      $lastThiryDate= date('Y-m-d',strtotime('-29 day'));
                      */
                      $quizResults = \app\models\ExamQuizType::find()
                    ->select(['exam_quiz_type.*','eq.*'])
                    ->innerJoin('exam_quiz eq','eq.test_id=exam_quiz_type.id')
                    ->where([
                        'eq.fk_branch_id'=>Yii::$app->common->getBranch(),
                        'eq.stu_id'=>$_GET['id'],
                    ])->andWhere(['between', 'exam_quiz_type.quiz_date', $sessionStartDate, $sessionEndDate])
                    ->asArray()->all();
---
SELECT `exam_quiz_type`.*, `eq`.* FROM `exam_quiz_type` INNER JOIN `exam_quiz` `eq` ON eq.test_id=exam_quiz_type.id WHERE ((`eq`.`fk_branch_id`=1) AND (`eq`.`stu_id`='597')) AND (`exam_quiz_type`.`quiz_date` BETWEEN '2020-03-30' AND '2021-03-30')