views/student/search.php

SELECT * FROM `ref_session` WHERE `session_id`='2'
---
              <?php
              $i=0;
              foreach ($userDetails as $key => $userDetailsvalue) {
                $sessionDetails=\app\models\RefSession::find()->where(['session_id'=>$userDetailsvalue['session_id']])->one();