views/reports/academics/leaving-pdf.php

use app\models\StudentLeaveInfo;
use app\models\RefClass;
use yii\helpers\Url;
$levInfo=StudentLeaveInfo::find()->where(['stu_id'=>$id])->one();
---
SELECT * FROM `student_leave_info` WHERE `stu_id`='441'

$getstuid=studentInfo::find()->where(['stu_id'=>$id])->one();
$classname_leaveform=RefClass::find()->where(['class_id'=>$levInfo->enrollment_class])->one();
// echo '<pre>';print_r($levInfo);die;
$users=User::find()->where(['id'=>$getstuid->user_id])->one();
$firstClass=StuRegLogAssociation::find()->where(['fk_stu_id'=>$id])->orderBy(['id'=>SORT_DESC])->one();
---
SELECT * FROM `user` WHERE `id`=442
SELECT * FROM `stu_reg_log_association` WHERE `fk_stu_id`='441' ORDER BY `id` DESC

  font-size: 17px;"><i>

<ol>
  <li><?php if($getstuid->gender_type == 1){echo 'S/O';}else{echo 'D/O';}?> <b><?php echo yii::$app->common->getParentName($id); ?></b>, Resident of <?php echo strtolower($getstuid->location1 .' '. $getstuid->city->city_name .' '.  $getstuid->district->District_Name .' '. $getstuid->province->province_name .' '. $getstuid->country->country_name) ?> </li>
---
SELECT * FROM `ref_cities` WHERE `city_id`=1537
SELECT * FROM `ref_countries` WHERE `country_id`=1
SELECT * FROM `ref_district` WHERE `district_id`=153
SELECT * FROM `ref_province` WHERE `province_id`=1