views/fee-plan/_columns.php

use yii\helpers\Url;
use yii\helpers\Html;
use yii\helpers\ArrayHelper;
$classArray = ArrayHelper::map(\app\models\RefClass::find()->where(['fk_branch_id'=>Yii::$app->common->getBranch(),'status'=>'active'])->all(),'class_id','title');
---
SELECT * FROM `ref_class` WHERE (`fk_branch_id`=1) AND (`status`='active')

    [
        'label'=>'Registeration #',
        'value'=>function($data){
            $student_id = \app\models\StudentInfo::find()->select(['user_id'])->where(['stu_id'=>$data->stu_id])->one();
            $user_id = \app\models\User::find()->select(['username'])->where(['id'=>$student_id->user_id])->one();
---
SELECT `user_id` FROM `student_info` WHERE `stu_id`=1820
SELECT `username` FROM `user` WHERE `id`=1933

        //'attribute'=>'stu_id',
        'label'=>'Student',
        'value'=>function($data){
            $user_id = \app\models\StudentInfo::find()->select(['user_id'])->where(['stu_id'=>$data->stu_id])->one();
---
SELECT `user_id` FROM `student_info` WHERE `stu_id`=1820

        'class'=>'\kartik\grid\DataColumn',
       // 'attribute' => 'fk_class_id',
        'label'=>'Class',
        'filter'=>ArrayHelper::map(\app\models\RefClass::find()->asArray()->all(), 'class_id', 'title'),
        'value'=>function($data){
            $user_id = \app\models\StudentInfo::find()->select(['class_id'])->where(['stu_id'=>$data->stu_id])->one();
---
SELECT * FROM `ref_class`
SELECT `class_id` FROM `student_info` WHERE `stu_id`=1820

    [
        'label'=>'Section',
        'value'=>function($data){
            $user_id = \app\models\StudentInfo::find()->select(['section_id'])->where(['stu_id'=>$data->stu_id])->one();
---
SELECT `section_id` FROM `student_info` WHERE `stu_id`=1820

        //'attribute'=>'fee_head_id',
        'label'=>'Fee Head',
        'value'=>function($data){
            $fee_heads = \app\models\FeeHead::find()->select(['title'])->where(['id'=>$data->fee_head_id])->one();
---
SELECT `title` FROM `fee_head` WHERE `id`=4

    [
        'label'=>'Discount Type',
        'value'=>function($data){
          $feeDiscountTypes = \app\models\FeeDiscountTypes::find()->select(['title'])->where(['id'=>$data->fk_fee_discounts_type_id])->one();
---
SELECT `title` FROM `fee_discount_types` WHERE `id`=17

        'buttons' => [
            'update' => function ($url, $model, $key)
            {
                $feeHead= \app\models\FeeHead::find()->where(['id'=>$model->fee_head_id,'one_time_payment'=>1])->count();
---
SELECT COUNT(*) FROM `fee_head` WHERE (`id`=4) AND (`one_time_payment`=1)

            },
        ],
        'urlCreator' => function($action, $model, $key, $index) {
            $feeHead= \app\models\FeeHead::find()->where(['id'=>$model->fee_head_id,'one_time_payment'=>1])->count();
---
SELECT COUNT(*) FROM `fee_head` WHERE (`id`=4) AND (`one_time_payment`=1)