views/site/roles/dashboard-account.php

SELECT COUNT(*) FROM `student_info` WHERE (`is_active`=1) AND (`fk_branch_id`=1)
---
              <?= Yii::$app->session->getFlash('success') ?>
           </div>
            <?php endif;
             $total_students=StudentInfo::find()->where(['is_active'=>1,'fk_branch_id'=>yii::$app->common->getBranch()])->count(); ?>

SELECT COUNT(*) FROM `student_info` WHERE (`class_id`=1) AND (`fk_branch_id`=1) AND (`is_active`=1)
---
    </thead>
    <tbody>
      <?php foreach ($class as $classvalue) {
        $getStudntcount=StudentInfo::find()->where(['class_id'=>$classvalue->class_id,'fk_branch_id'=>yii::$app->common->getBranch(),'is_active'=>1])->count();