views/site/roles/student-dashboard.php

SELECT * FROM `student_info` WHERE (`is_active`=1) AND (`fk_branch_id`=1) AND (`user_id`=940)
---
              <?= Yii::$app->session->getFlash('success') ?>
           </div>
            <?php endif;
             $studentsGet=StudentInfo::find()->where(['is_active'=>1,'fk_branch_id'=>yii::$app->common->getBranch(),'user_id'=>Yii::$app->user->identity->id])->one(); ?>