models/User.php

    public static function findByUsername($username)
    {
        //'fk_branch_id'=>Yii::$app->common->getBranch();
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='AMS-004') AND (`status`='active')